tests/performance/artillery.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Normal load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Content-Type: 'application/json'
  processor: './helpers.js'

scenarios:
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/healthz"
          expect:
            - statusCode: 200
            - hasProperty: "status"

  - name: "Authentication Flow"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $randomEmail() }}"
            password: "testpassword123"
          capture:
            - json: "$.access_token"
              as: "token"
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Patient Management"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "provider@example.com"
            password: "testpassword123"
          capture:
            - json: "$.access_token"
              as: "token"
      - get:
          url: "/api/patients"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - post:
          url: "/api/patients"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            first_name: "{{ $randomFirstName() }}"
            last_name: "{{ $randomLastName() }}"
            email: "{{ $randomEmail() }}"
            phone: "{{ $randomPhoneNumber() }}"
            date_of_birth: "1990-01-01"
          expect:
            - statusCode: 201

  - name: "Appointment Scheduling"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "provider@example.com"
            password: "testpassword123"
          capture:
            - json: "$.access_token"
              as: "token"
      - get:
          url: "/api/appointments"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - post:
          url: "/api/appointments"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            patient_id: "{{ $randomUUID() }}"
            provider_id: "{{ $randomUUID() }}"
            appointment_date: "2024-12-01T10:00:00Z"
            duration_minutes: 60
            appointment_type: "consultation"
          expect:
            - statusCode: 201